In [1]:
import pandas as pd

# Dataframe

In [2]:
# dictionar to list
d={'name':["roshni","ali","m.ali","usama"],'age':[26,15,18,12]}
da=pd.DataFrame(d)
da

     name  age
0  roshni   26
1     ali   15
2   m.ali   18
3   usama   12

In [26]:
# dictionary to tupple
d1={'name':("roshni","ali","m.ali","usama"),'age':(26,15,18,12)}
da1=pd.DataFrame(d)
da1

     name  age
0  roshni   26
1     ali   15
2   m.ali   18
3   usama   12

In [11]:
# list to dictionary
d2=[{'name':'roshni',"age":26},{"name":'ali','age':15},{'name':'m.ali','age':18}]
da2=pd.DataFrame(d2)
da2

     name  age
0  roshni   26
1     ali   15
2   m.ali   18

In [13]:
# tuple to dictionary
d3=({'name':'roshni',"age":26},{"name":'ali','age':15},{'name':'m.ali','age':18})
da3=pd.DataFrame(d3)
da3

     name  age
0  roshni   26
1     ali   15
2   m.ali   18

In [18]:
# list to list     number of elements = number of columns
li=[['ali',15],['roshni',26]] 
li1=pd.DataFrame(li,columns=['name','age'])
li1

     name  age
0     ali   15
1  roshni   26

In [19]:
# tuple to tuple
t=(('ali',15),('roshni',26)) 
t1=pd.DataFrame(t,columns=('name','age'))
t1

     name  age
0     ali   15
1  roshni   26

# Read and Write data

In [20]:
# read csv data
df=pd.read_csv('apple_orange.csv')
df

    weight  size   class
0       69  4.39  orange
1       69  4.21  orange
2       65  4.09  orange
3       72  5.85   apple
4       67  4.70  orange
5       73  5.67   apple
6       70  5.56   apple
7       75  5.11   apple
8       74  5.36   apple
9       65  4.27  orange
10      73  5.79   apple
11      70  5.47   apple
12      68  5.53   apple
13      74  5.22  orange

In [27]:
# write data
data=da1.to_csv(r'C:\Users\HP\OneDrive\Desktop\Interview\python\data.csv')
data

# loc and iloc method

In [28]:
# single value access with loc
df.loc[1,'size']

4.21

In [31]:
# single value access with iloc
df.iloc[1,1]

4.21

In [32]:
# all column with single row
df.loc[4,:]

weight        67
size         4.7
class     orange
Name: 4, dtype: object

In [34]:
# all rows with single column
df.loc[:,'size']

0     4.39
1     4.21
2     4.09
3     5.85
4     4.70
5     5.67
6     5.56
7     5.11
8     5.36
9     4.27
10    5.79
11    5.47
12    5.53
13    5.22
Name: size, dtype: float64

In [35]:
# multi rows with single column
df.loc[[0,2,4],'class']

0    orange
2    orange
4    orange
Name: class, dtype: object

In [36]:
# multi columns with single row
df.loc[1,['size','class']]

size       4.21
class    orange
Name: 1, dtype: object

In [37]:
# multi rows with multi columns
df.loc[[1,2,3],['weight','class','size']]

   weight   class  size
1      69  orange  4.21
2      65  orange  4.09
3      72   apple  5.85